/**
 * * 그래프
 * * node(vertax) : 위치, 정점을 뜻함
 * * (Edge) : 위치 간의 관계를 표시한 선으로 노드를 연결한 선
 * * Adjacent Vertex : 간선으로 직접 연결된 노드
 * * Degree : 정점의 차수
 * * In-Degree : 외부에서 오는 간선의 수
 * * Out-Degree : 외부로 항하는 간선의 수
 * * Path Length : 경로를 구성하기 위해 사용된 간선 수
 * * Simple Path : 처음 정점과 끝 정점을 제외하고 중복된 정점이 없는 경로
 * * Cycle : 단순 경로의 시작점과 종료점이 동일한 경우
 * todo: 무방향 그래프 -> Edge에 방향이 없는 그래프, 양방향
 * todo: 방향 그래프 -> Edge에 방향이 있는 그래프
 * todo: 가중치 그래프 -> Edge에 비용이 할당된 그래프, 네트워크
 * todo: 완전 그래프 -> 모든 노드가 서로 연결되어 있는 그래프
 * ? 그래프와 트리의 차이
 * ?            그래프                                         트리
 * ? 정의   노드와 노드를 연결하는 간선으로 표현되는 구조    그래프의 한 종류, 방향성이 있는 비순환 그래프
 * ? 방향성  방향, 무방향                            방향 그래프만 존재
 * ? 사이클  사이클 가능, 순환, 비순환 모두 존재          비순환 그래프로 사이클이 존재하지 않음
 * ? 루트   존재하지 않음                            존재함
 * ? 부모   존재하지 않음                            존재함
 */
